app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "test_long"], ["text", "updated\r\n"], ["updated_at", "2018-09-28 15:09:40.030460"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)